{
    "c2array": true,
    "size": [
        9,
        48,
        1
    ],
    "data": [
        [
            [
                "[color=#ffff00]How to play:[/color]\n    - Press [color=#ffff00]Space[/color] to go to the next dialogue\n    - Press [color=#ffff00]Arrows Up/Down[/color] to select an option when available"
            ],
            [
                "[i]Today, I'm hanging out with Bob and Chris. Bob's all about that poetry club, and Chris is all in on the robotics club. I'm feeling like I need a change this semester, so I might just try to sweet-talk one of them into letting me join their club.[/i]"
            ],
            [
                "[i]You know what's interesting? Both of them are into RPGs. So, my genius plan is to get us all playing an RPG and have a good time. Hopefully, that'll open the door to an invitation. The question is, which RPG should I go for to up my chances?[/i]"
            ],
            [
                "[u][b]You:[/b][/u] Hey there! I've been tossing this idea around – how about we dive into some RPG after class? What are your thoughts on that?"
            ],
            [
                "[u][b]Bob:[/b][/u] Hey, that sounds awesome! I'm totally up for some RPG action later. Count me in!"
            ],
            [
                "[u][b]Chris:[/b][/u] Hi Anna! RPGs sound cool! I'm down to play, but do we know which RPG we're diving into?"
            ],
            [
                "[i]Now, gotta tread carefully here... Maybe I'll just start by tossing out some general ideas.[/i]"
            ],
            [
                "[u][b]You:[/b][/u] What about a..."
            ],
            [
                "[u][b]Bob:[/b][/u] That's music to my ears! Imagine facing off against a colossal Kraken or other legendary beasts."
            ],
            [
                "[u][b]Chris:[/b][/u] Alright, I'm okay with that. Epic monsters could be interesting, I suppose. "
            ],
            [
                "[u][b]Bob:[/b][/u] Creepy aliens, huh? Well, I can roll with that."
            ],
            [
                "[u][b]Chris:[/b][/u] Aliens? Heck yes! Let's make it out-of-this-world awesome!"
            ],
            [
                "[i]Yeah... I can see one of them is more excited about my suggestion... Well, let's keep going.[/i]"
            ],
            [
                "[u][b]You:[/b][/u] Now, we must decide what our team will be."
            ],
            [
                "[u][b]Chris:[/u][/b] What if we play as high-tech [u]miners[/u]? We'd use minerals to forge these amazing tools that help us face all sorts of enemies."
            ],
            [
                "[u][b]Bob:[/u][/b] Not exactly my cup of tea..."
            ],
            [
                "[u][b]Bob:[/u][/b] What if we were [u]musicians[/u] instead? Our instruments could transform into fantastical weapons to battle the threats we encounter!"
            ],
            [
                "[u][b]Both:[/u][/b] What do you think, Anna?"
            ],
            [
                "[i]I'm really torn here... I can't please both of them. No matter what I choose, one of them will be disappointed. Maybe I am overthinking.[/i]"
            ],
            [
                "[u][b]You:[/b][/u] Well, I think we should be..."
            ],
            [
                "[i]Hmm. That made Bob disappointed. I wasn't overthinking, after all.[/i] "
            ],
            [
                "[i]Hmm. That made Chris disappointed. I wasn't overthinking, after all.[/i]"
            ],
            [
                "[u][b]You:[/b][/u] Let's wrap this up by choosing the setting."
            ],
            [
                "[u][b]You:[/b][/u] Picture this: a floating city powered by magic. It's a place where arcane forces keep the city afloat among the clouds, and mystical energy runs through every aspect of life. Think of it as a soaring, magical metropolis."
            ],
            [
                "[u][b]Bob:[/u][/b] That floating city idea is beyond incredible! The thought of soaring among the clouds with magic in the air – I'm totally onboard with this."
            ],
            [
                "[u][b]Chris:[/u][/b] The whole floating city thing doesn't quite do it for me. It sounds a bit...predictable, you know? But let's do it."
            ],
            [
                "[u][b]You:[/b][/u] Picture this: a hidden underground base powered by geothermal technology. A sprawling, subterranean complex where advanced machinery harnesses the Earth's energy to sustain life."
            ],
            [
                "[u][b]Chris:[/u][/b] The underground base powered by geothermal tech? Now that's right up my alley! The whole high-tech, subterranean vibe – absolutely love it! "
            ],
            [
                "[u][b]Bob:[/u][/b] You know, Anna, the underground base concept feels a bit... ordinary. I was kind of hoping for something more enchanting, but this will do."
            ],
            [
                "[u][b]You:[/b][/u] Alright, folks, looks like we've got a plan. Time to head to class, though. We're running a bit late."
            ],
            [
                "... ... ... The class starts ... ... ..."
            ],
            [
                "... ... ... The class ends ... ... ..."
            ],
            [
                "[i]Finally! Time to dive into this RPG and see if one of the guys invites me to their club. I'm so stoked![/i]"
            ],
            [
                "[u][b]Both:[/b][/u] Hey Anna! So, let's get this RPG going?"
            ],
            [
                "[u][b]Chris:[/b][/u] I've got a nearby spot in mind that should be free. Let's set up there for our game."
            ],
            [
                "[u][b]Chris:[/b][/u] Welcome to our gaming HQ! This is actually the room where they usually hold extra math classes, but students have been acing it lately, so no extra classes for us. We've got this whole place to ourselves!"
            ],
            [
                "[u][b]Bob:[/b][/u] Hey, that's awesome that everyone's nailing their math, but I've gotta admit, I could use some extra math practice. Thankfully, everything else is going pretty well."
            ],
            [
                "[u][b]You:[/b][/u] Chris, big thanks for finding this cool spot for us! Now, no more waiting around, folks. Our RPG adventure is about to begin!"
            ],
            [
                "... ... ... And so the adventure starts ... ... ..."
            ],
            [
                "... ... ... A span of hours drifts away, and now it's time to go home ... ... ..."
            ],
            [
                "[u][b]You:[/b][/u] It was an awesome game. Can't wait to dive back into the campaign tomorrow!"
            ],
            [
                "[u][b]Bob:[/b][/u] Thank you for the RPG session, guys. See you tomorrow!"
            ],
            [
                "[u][b]Chris:[/b][/u] Yeah! Pretty fun campaign. See ya!"
            ],
            [
                "[u][b]Bob:[/b][/u] By the way, Anna, you had some seriously creative ideas for this RPG. It makes me think you'd be a perfect fit for the poetry club too. You ever thought about joining?"
            ],
            [
                "[u][b]Chris:[/b][/u] Anna, your RPG ideas were seriously impressive. You know, I run the robotics club, and I think your creativity could shine there too. Ever considered giving it a shot?"
            ],
            [
                "[i]Well, that didn't go exactly as planned. I was hoping one of them might invite me to their club. But, hey, it's not the end of the world. There are plenty of clubs out there, and who knows, maybe I'll find something in the near future.[/i]"
            ],
            [
                "[u][b]You:[/b][/u] Wow, thanks for the invite! I've always wanted to join the club!"
            ],
            [
                "Press [color=#ffff00]Space[/color] to restart..."
            ]
        ],
        [
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                "a game with epic monsters?"
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                "miners!"
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                "an arcane floating city"
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ]
        ],
        [
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                "a game with creepy aliens?"
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                "musicians!"
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                "an advanced underground complex"
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ]
        ],
        [
            [
                1
            ],
            [
                2
            ],
            [
                3
            ],
            [
                4
            ],
            [
                5
            ],
            [
                6
            ],
            [
                7
            ],
            [
                8
            ],
            [
                9
            ],
            [
                12
            ],
            [
                11
            ],
            [
                12
            ],
            [
                13
            ],
            [
                14
            ],
            [
                15
            ],
            [
                16
            ],
            [
                17
            ],
            [
                18
            ],
            [
                19
            ],
            [
                20
            ],
            [
                22
            ],
            [
                22
            ],
            [
                23
            ],
            [
                24
            ],
            [
                25
            ],
            [
                29
            ],
            [
                27
            ],
            [
                28
            ],
            [
                29
            ],
            [
                30
            ],
            [
                31
            ],
            [
                32
            ],
            [
                33
            ],
            [
                34
            ],
            [
                35
            ],
            [
                36
            ],
            [
                37
            ],
            [
                38
            ],
            [
                39
            ],
            [
                40
            ],
            [
                41
            ],
            [
                42
            ],
            [
                999
            ],
            [
                46
            ],
            [
                46
            ],
            [
                47
            ],
            [
                47
            ],
            [
                48
            ]
        ],
        [
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                10
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                21
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                26
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ]
        ],
        [
            [
                ""
            ],
            [
                "Outside"
            ],
            [
                ""
            ],
            [
                "Hallway"
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                "FadeOut"
            ],
            [
                ""
            ],
            [
                "Hallway"
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                "Classroom"
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                "FadeOut"
            ],
            [
                ""
            ],
            [
                "Classroom"
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                "FadeOut"
            ]
        ],
        [
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                "bob_normal"
            ],
            [
                "bob_happy"
            ],
            [
                ""
            ],
            [
                "bob_normal"
            ],
            [
                ""
            ],
            [
                "bob_happy"
            ],
            [
                ""
            ],
            [
                "bob_meh"
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                "bob_normal"
            ],
            [
                ""
            ],
            [
                "bob_meh"
            ],
            [
                "bob_happy"
            ],
            [
                "bob_normal"
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                "bob_sad"
            ],
            [
                "bob_happy"
            ],
            [
                "bob_normal"
            ],
            [
                ""
            ],
            [
                "bob_happy"
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                "bob_sad"
            ],
            [
                "bob_meh"
            ],
            [
                "none"
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                "bob_happy"
            ],
            [
                ""
            ],
            [
                "bob_normal"
            ],
            [
                "bob_happy"
            ],
            [
                ""
            ],
            [
                "none"
            ],
            [
                ""
            ],
            [
                "bob_normal"
            ],
            [
                "bob_happy"
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                "none"
            ],
            [
                "none"
            ],
            [
                ""
            ],
            [
                "none"
            ]
        ],
        [
            [
                ""
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                "chris_normal"
            ],
            [
                ""
            ],
            [
                "chris_happy"
            ],
            [
                "chris_normal"
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                "chris_meh"
            ],
            [
                ""
            ],
            [
                "chris_happy"
            ],
            [
                ""
            ],
            [
                "chris_normal"
            ],
            [
                "chris_happy"
            ],
            [
                "chris_normal"
            ],
            [
                ""
            ],
            [
                "chris_normal"
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                "chris_happy"
            ],
            [
                "chris_sad"
            ],
            [
                "chris_normal"
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                "chris_sad"
            ],
            [
                ""
            ],
            [
                "chris_happy"
            ],
            [
                ""
            ],
            [
                "chris_meh"
            ],
            [
                "none"
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                "chris_happy"
            ],
            [
                ""
            ],
            [
                "chris_happy"
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                "none"
            ],
            [
                ""
            ],
            [
                "chris_normal"
            ],
            [
                ""
            ],
            [
                "chris_happy"
            ],
            [
                "none"
            ],
            [
                ""
            ],
            [
                "none"
            ],
            [
                ""
            ],
            [
                "none"
            ]
        ],
        [
            [
                ""
            ],
            [
                0
            ],
            [
                0
            ],
            [
                0
            ],
            [
                0
            ],
            [
                0
            ],
            [
                0
            ],
            [
                0
            ],
            [
                1
            ],
            [
                0
            ],
            [
                -1
            ],
            [
                0
            ],
            [
                0
            ],
            [
                0
            ],
            [
                0
            ],
            [
                0
            ],
            [
                0
            ],
            [
                0
            ],
            [
                0
            ],
            [
                0
            ],
            [
                -1
            ],
            [
                1
            ],
            [
                0
            ],
            [
                1
            ],
            [
                0
            ],
            [
                0
            ],
            [
                -1
            ],
            [
                0
            ],
            [
                0
            ],
            [
                0
            ],
            [
                0
            ],
            [
                0
            ],
            [
                0
            ],
            [
                0
            ],
            [
                0
            ],
            [
                0
            ],
            [
                0
            ],
            [
                0
            ],
            [
                0
            ],
            [
                0
            ],
            [
                0
            ],
            [
                0
            ],
            [
                0
            ],
            [
                0
            ],
            [
                0
            ],
            [
                0
            ],
            [
                0
            ],
            [
                0
            ]
        ]
    ]
}